{
  "id": "P2_1_2positionVelocity",
  "title": "Unit 2.1 & 2.2 — Position, Displacement, Speed, and Velocity",
  "nav": ["overview", "notes", "interactive", "examples", "practice", "images"],
  "views": {
    "overview": [
      "I. Lesson Goals",
      "- Define and differentiate position, distance, displacement, speed, and velocity.",
      "- Explain why displacement is a vector and distance is a scalar.",
      "- Compute average speed and average velocity from motion descriptions or data.",
      "- Interpret motion on a 1D number line and with chosen reference frames.",
      "- Relate constant velocity to average velocity over an interval.",
      "- Use the PositionVelocityExplorer to visualize position, distance, and velocity."
    ],
    "notes": {
      "steps": [
        "I. Position & Reference Frames (2.1)",
        "- Position is an object’s location relative to a chosen reference point (origin).",
        "- A reference frame is the coordinate system and zero point you pick to measure motion.",
        "//image _ number_line.png",
        "- In 1D motion, use a number line: positions can be positive (+x) or negative (−x).",
        "- Choosing the origin at the starting point is common, but any fixed point works.",
        "- Always state the frame to avoid ambiguity (e.g., “relative to the ground”).",
        "//image _ reference_frame.png",

        "II. Distance vs. Displacement (2.1)",
        "- Distance = total path length traveled (scalar; no direction).",
        "- Displacement = change in position = x_final − x_initial (vector; has sign/direction).",
        "- Distance ≥ |displacement|; equality only for straight-line motion without reversals.",
        "- Distance cannot be negative; displacement can be positive, zero, or negative.",
        "- Example: Walk 3 m east, then 3 m west → distance = 6 m; displacement = 0 m.",

        "III. Stockcar Race Example (2.1)",
        "//image _ stockcar_race.png",
        "- Cars may travel ~500 miles around a loop; start and finish are at the same place.",
        "- Distance is large, but displacement is near zero (net change in position ≈ 0).",
        "- This highlights why distance and displacement are not the same.",

        "IV. Interpreting Direction (2.1)",
        "- Use sign conventions: +x (east/right), −x (west/left), etc.",
        "- Displacement sign indicates direction relative to the chosen + axis.",
        "- Reporting a displacement should include both magnitude and direction (or sign).",

        "V. Scalars vs. Vectors (Bridge to 2.2)",
        "- Scalars: magnitude only (distance, speed, time, mass, temperature).",
        "- Vectors: magnitude + direction (displacement, velocity, acceleration, force).",
        "- Vector quantities require a direction or a sign in 1D.",

        "VI. Speed vs. Velocity (2.2)",
        "//image _ x15_aircraft.png",
        "- Speed = distance ÷ time (scalar).",
        "- Velocity = displacement ÷ time (vector).",
        "- Same trip can have the same average speed but different average velocity if direction changes.",
        "- If displacement over an interval is zero, average velocity over that interval is zero.",

        "VII. Average Speed (2.2)",
        "- Average speed = total distance / total time.",
        "- It summarizes overall rate, regardless of direction changes.",
        "- Example: A 700 m path covered in 20 s → average speed = 35 m/s.",
        "- Average speed does not imply the object ever moved at that exact instantaneous value.",

        "VIII. Average Velocity (2.2)",
        "- Average velocity = total displacement / total time.",
        "- Requires direction (sign). A zero displacement gives zero average velocity.",
        "- Example: Out-and-back motion can have large distance but zero average velocity.",

        "IX. Constant vs. Average Velocity (2.2)",
        "- Constant velocity: speed and direction remain unchanged at every instant.",
        "- Average velocity: net change over an interval; speeds may vary within the interval.",
        "- Two trips can share the same average speed but not the same velocity if directions differ.",

        "X. Worked 1D Example (2.2)",
        "- Suppose x changes from +12 m to −6 m in 3.0 s.",
        "- Displacement = (−6) − (+12) = −18 m.",
        "- Average velocity = −18 m / 3.0 s = −6.0 m/s (toward negative x).",
        "- Sign indicates direction relative to the chosen axis.",

        "XI. Reference Frame Dependence (2.2)",
        "- Measured velocities depend on the observer’s frame (ground vs. moving vehicle).",
        "- In astronomy, Earth’s velocity may be stated relative to the Sun or to the galaxy.",
        "- Always state or infer the frame when comparing or combining velocities.",

        "XII. Unit Check & Reporting (2.1/2.2)",
        "- Use SI units unless specified: distance/displacement in meters, time in seconds, speed/velocity in m/s.",
        "- For everyday contexts, km/h or mph may be used; convert carefully.",
        "- Include direction (sign or words like east/west) for displacement and velocity.",

        "XIII. Quick Concept Checks (2.1)",
        "- Can distance ever be less than |displacement|? No.",
        "- Can displacement be zero while distance is nonzero? Yes (closed path).",
        "- Does displacement require a reference frame? Yes (to define positive/negative).",

        "XIV. Quick Concept Checks (2.2)",
        "- Can average speed be zero while moving? No; moving implies distance > 0.",
        "- Can average velocity be zero while moving? Yes; if displacement = 0.",
        "- Does constant speed guarantee constant velocity? Only if direction is constant too.",

        "XV. Summary (2.1 + 2.2)",
        "- Position is measured relative to a chosen origin in a reference frame.",
        "- Distance is path length (scalar); displacement is net change in position (vector).",
        "- Speed uses distance; velocity uses displacement.",
        "- Average speed ≠ average velocity in general.",
        "- Constant velocity requires steady speed and unchanging direction.",
        "- Frame of reference matters for interpreting and comparing motion."
      ]
    },
    "interactive": {
      "href": "./toolviewer/index.html#/position-velocity-explorer",
      "label": "Open Tool (PositionVelocityExplorer)",
      "embed": true,
      "iframeHeight": "75vh"
    },
    "examples": {
      "steps": [
        "Ex 1 (2.1 Review) — Distance vs. Displacement",
        "Prompt: Explain the difference between distance and displacement in your own words.",
        "Step 1: Identify the quantities. Distance is total path length; displacement is net change in position.",
        "Step 2: Highlight direction: Displacement has direction (vector), distance does not (scalar).",
        "Conclusion: Distance counts every step along the path; displacement only cares about start and finish positions (with direction).",

        "Ex 2 (2.1 Review) — John’s Evening Walk",
        "Prompt: John lives on a square block, 180 yd per side, and walks once around the block.",
        "Step 1: Compute distance: Perimeter = 4 × 180 = 720 yd.",
        "Step 2: Determine displacement: Starts and ends at the same spot → displacement = 0.",
        "Conclusion: Distance = 720 yd; Displacement = 0 (return to start).",

        "Ex 3 (2.1 Review) — Joanna’s Position",
        "Prompt: House at 0 ft, school at +8000 ft. Joanna walks 100 ft west of her house.",
        "Step 1: Choose sign convention: East is +, West is −.",
        "Step 2: Position 100 ft west of 0 → x = −100 ft.",
        "Conclusion: Joanna’s position is −100 ft relative to the origin.",

        "Ex 4 (2.2 Review) — Average Speed on a Trip",
        "Prompt: Jane traveled 340 miles in 8.0 hours. What was her average speed?",
        "Step 1: Use average speed = total distance / total time.",
        "Step 2: 340 miles / 8.0 h = 42.5 mph.",
        "Conclusion: Average speed = 42.5 mph.",

        "Ex 5 (2.2 Review) — Average Velocity on a Number Line",
        "Prompt: Object moves from x = 12 m to x = 124 m, then back to x = 98 m in 10 s. Find average velocity.",
        "Step 1: Total displacement = x_final − x_initial = 98 − 12 = 86 m.",
        "Step 2: Average velocity = displacement / time = 86 m / 10 s = 8.6 m/s.",
        "Conclusion: Average velocity = +8.6 m/s (toward +x)."
      ]
    },
    "practice": {
      "steps": [
        "[2.1] Q1 — City blocks path: 6E, 2N, 3W, 4S. What is total distance?",
        "Step 1: Sum segment lengths regardless of direction: 6 + 2 + 3 + 4.",
        "Step 2: Compute: 15 blocks.",
        "Answer: 15 blocks.",

        "[2.1] Q2 — Fill in the blank: The length of the route between two points is ________.",
        "Step 1: Identify definition requested: path length along the route.",
        "Answer: Distance.",

        "[2.1] Q3 — Bus travels 6 km east and 8 km south. What is the magnitude of its resultant displacement?",
        "Step 1: Recognize a right triangle with legs 6 km and 8 km.",
        "Step 2: Apply Pythagorean theorem: √(6² + 8²) = √(36 + 64) = √100.",
        "Step 3: Compute magnitude: 10 km.",
        "Answer: 10 km.",

        "[2.1] Q4 — A person walks 4 m east and then 18 m west. Find the displacement (magnitude and direction).",
        "Step 1: Choose east as +, west as −.",
        "Step 2: Net displacement = (+4) + (−18) = −14 m.",
        "Step 3: Magnitude is 14 m; direction is west.",
        "Answer: 14 m west.",

        "[2.1] Q5 — A lizard runs 3 m to a rock, then halfway back and stops. What is total distance traveled?",
        "Step 1: Outbound distance = 3 m.",
        "Step 2: Halfway back = 1.5 m.",
        "Step 3: Total distance = 3 + 1.5 = 4.5 m.",
        "Answer: 4.5 m.",

        "[2.1] Q6 — Fill in the blank: The change in position of an object is called ________.",
        "Step 1: Identify definition of x_final − x_initial.",
        "Answer: Displacement.",

        "[2.1] Q7 — John walks around a square block and ends where he started. His final displacement is zero. (T/F)",
        "Step 1: Start and end positions are the same → displacement = 0.",
        "Answer: TRUE.",

        "[2.1] Q8 — You travel three complete laps around a circular lawn (radius R) and return to start. Displacement is zero. (T/F)",
        "Step 1: Completing whole laps returns you to the starting point.",
        "Answer: TRUE.",

        "[2.1] Q9 — What describes the space between two objects without a reference point or direction?",
        "Step 1: Quantity without direction describing separation along the path.",
        "Answer: Distance.",

        "[2.1] Q10 — Walk 5 m east, then 20 m west. What is your total displacement (magnitude and direction)?",
        "Step 1: Net displacement = (+5) + (−20) = −15 m.",
        "Step 2: Magnitude 15 m; direction west.",
        "Answer: 15 m west.",

        "[2.2] Q1 — A girl runs one full revolution on a circular track of radius 200 m in 10 min. Average velocity?",
        "Step 1: One full lap returns to starting point → displacement = 0.",
        "Step 2: Average velocity = displacement / time = 0 / (10 min) = 0.",
        "Answer: Zero.",

        "[2.2] Q2 — Average velocity can never be zero but average speed can be zero for a moving object. (T/F)",
        "Step 1: If displacement is zero over an interval, average velocity can be zero.",
        "Step 2: If the object moved, distance > 0, so average speed cannot be zero for that interval.",
        "Answer: FALSE.",

        "[2.2] Q3 — Speed is a scalar quantity, whereas velocity is a vector quantity. (T/F)",
        "Step 1: Speed has magnitude only; velocity has magnitude and direction.",
        "Answer: TRUE.",

        "[2.2] Q4 — An object may have varying speed without having varying velocity. (T/F)",
        "Step 1: If speed varies, velocity’s magnitude varies; unless direction changes exactly to compensate, velocity varies.",
        "Answer: FALSE.",

        "[2.2] Q5 — Average velocity is equal to total displacement divided by total time. (T/F)",
        "Step 1: This is the definition of average velocity.",
        "Answer: TRUE.",

        "[2.2] Q6 — A car travels 270 m in 30 s. What is its average speed?",
        "Step 1: Use v_avg = distance / time = 270 / 30.",
        "Step 2: Compute: 9 m/s.",
        "Answer: 9 m/s.",

        "[2.2] Q7 — A truck takes 54 s to cross an 839 m bridge. How long to cross a 1280 m bridge at the same speed?",
        "Step 1: Compute speed on first bridge: v = 839 / 54 m/s.",
        "Step 2: Time for 1280 m: t = 1280 / v = 1280 × (54 / 839) s.",
        "Step 3: Compute: v ≈ 15.54 m/s; t ≈ 82.6 s.",
        "Answer: ≈ 82.6 s.",

        "[2.2] Q8 — The distance covered, divided by the time taken to cover that distance, is called speed. (T/F)",
        "Step 1: This restates the definition of speed.",
        "Answer: TRUE.",

        "[2.2] Q9 — If an object travels 1500 m in 50 s, what is its average velocity (1D, straight line)?",
        "Step 1: Assume displacement = distance in a straight line with fixed direction.",
        "Step 2: v_avg = 1500 / 50 = 30 m/s in the direction of motion.",
        "Answer: 30 m/s.",

        "[2.2] Q10 — The average velocity to complete a circular path will be zero. (T/F)",
        "Step 1: A complete loop has zero net displacement.",
        "Answer: TRUE."
      ]
    },
    "images": [
      "stockcar_race.png",
      "number_line.png",
      "reference_frame.png",
      "x15_aircraft.png"
    ]
  }
}
